import random 

chosen_one = ''
enabled_list_dare = []
enabled_list_truth = []



class generator_base:
    """база програми"""

    def __init__():
        """визначення атрибутів"""


    def creative_dare_enable():
        global enabled_list_dare
        enabled_list_dare.append('зроби ваншот/анімацію/комікс/арт, де головними героями є твій любимий персонаж і твій найменш любимий персонаж')
        enabled_list_dare.append('зроби ваншот/арт/анімацію по кросоверу твоєї вселенної з вселенною іншого гравця')
        enabled_list_dare.append("намалюй когось кого ти знаєш якби вони були в твоїй вселенній")
        enabled_list_dare.append("намалюй логотип клона відомого бренду що би підійшов до твоєї вселленної")
        enabled_list_dare.append('покрути колесо фортуни/вибери генератором чисел двох персонажів і зроби комікс/анімацію/ваншот/арт з ними')
        enabled_list_dare.append("зроби бінго по харектеру персонажа, і перевір як засильно ти подібний на того персонажа, перекреслюючи факти що підходять до твого характеру")
        enabled_list_dare.append("зроби комікс/анімацію/ваншот про любиму річ буль якого персонажа")
        enabled_list_dare.append("Намалюй кросовер з твоїми 2 любимими фандомами")
        enabled_list_dare.append("Зроби хедканони по твоєму любимому фандому")
        enabled_list_dare.append('зроби ваншот/анімацію/комікс/арт, де головними героями є твій любимий персонаж і твій найменш любимий персонаж')
        enabled_list_dare.append('зроби ваншот/арт/анімацію по кросоверу твого фандома з фандомом іншого гравця')
        enabled_list_dare.append("намалюй когось кого ти знаєш якби вони були в твому фандомі")
        enabled_list_dare.append("намалюй логотип клона відомого бренду що би підійшов до твого фандома")
        enabled_list_dare.append('покрути колесо фортуни/вибери генератором чисел двох твоїх персонажів і зроби комікс/анімацію/ваншот/арт з ними')
        enabled_list_dare.append("зроби бінго по харектеру твого персонажа, і перевір як засильно ти подібний на того персонажа, перекреслюючи факти що підходять до твого характеру")
        enabled_list_dare.append("зроби комікс/анімацію/ваншот про любиму річ буль якого твого персонажа")
        enabled_list_dare.append("Намалюй кросовер з твоїми 2 вселеннами або твоєю вселенною і твоїм фандомом")
        enabled_list_dare.append("Зроби хедканони по твоїй вселенній")
        

       
        



    def creative_dare_disable():
        global enabled_list_dare
        enabled_list_dare.remove('зроби ваншот/анімацію/комікс/арт, де головними героями є твій любимий персонаж і твій найменш любимий персонаж')
        enabled_list_dare.remove('зроби ваншот/арт/анімацію по кросоверу твоєї вселенної з вселенною іншого гравця')
        enabled_list_dare.remove("намалюй когось кого ти знаєш якби вони були в твоїй вселенній")
        enabled_list_dare.remove("намалюй логотип клона відомого бренду що би підійшов до твоєї вселленної")
        enabled_list_dare.remove('покрути колесо фортуни/вибери генератором чисел двох персонажів і зроби комікс/анімацію/ваншот/арт з ними')
        enabled_list_dare.remove("зроби бінго по харектеру персонажа, і перевір як засильно ти подібний на того персонажа, перекреслюючи факти що підходять до твого характеру")
        enabled_list_dare.remove("зроби комікс/анімацію/ваншот про любиму річ буль якого персонажа")
        enabled_list_dare.remove("Намалюй кросовер з твоїми 2 любимими фандомами")
        enabled_list_dare.remove("Зроби хедканони по твоєму любимому фандому")
        enabled_list_dare.remove('зроби ваншот/анімацію/комікс/арт, де головними героями є твій любимий персонаж і твій найменш любимий персонаж')
        enabled_list_dare.remove('зроби ваншот/арт/анімацію по кросоверу твого фандома з фандомом іншого гравця')
        enabled_list_dare.remove("намалюй когось кого ти знаєш якби вони були в твому фандомі")
        enabled_list_dare.remove("намалюй логотип клона відомого бренду що би підійшов до твого фандома")
        enabled_list_dare.remove('покрути колесо фортуни/вибери генератором чисел двох твоїх персонажів і зроби комікс/анімацію/ваншот/арт з ними')
        enabled_list_dare.remove("зроби бінго по харектеру твого персонажа, і перевір як засильно ти подібний на того персонажа, перекреслюючи факти що підходять до твого характеру")
        enabled_list_dare.remove("зроби комікс/анімацію/ваншот про любиму річ буль якого твого персонажа")
        enabled_list_dare.remove("Намалюй кросовер з твоїми 2 вселеннами або твоєю вселенною і твоїм фандомом")
        enabled_list_dare.remove("Зроби хедканони по твоїй вселенній")




    def creative_truth_enable():
        global enabled_list_truth
        enabled_list_truth.append('яка гра/філм/мультфілм/серіал/мультсеріал/книга/комікс/аніме/манга серйозно змінила вашу творчість?')
        enabled_list_truth.append("яким був твій перший персонаж? чи подобається він тобі зараз?")
        enabled_list_truth.append("які з ваших персів самі адекватні і розумні?")
        enabled_list_truth.append('який з ваших персонажів є самим найбільшим фанатом романтики')
        enabled_list_truth.append('чи в вас є персонажі-вегетерянці/персонажі-вегани?')
        enabled_list_truth.append('роскажіть про персонажа не створеного вами, який вплинув на вигляд/характер вашого персонажа')
        enabled_list_truth.append('Який був твій перший фандом?')
        enabled_list_truth.append("Назви на яких персонажів з твоїх фандомів найбільше схожі кожен з гравців")
        enabled_list_truth.append("Хто би виграв у битві: ти чи твій любимий персонаж?")
        enabled_list_truth.append('Чи в тебе є/були ОС по якомусь фандому? Якщо так, то опиши їх')
        enabled_list_truth.append("Які пісні з твого плейлиста, як ти думаєш, підходять персонажам твого фандому")
        enabled_list_truth.append("Який є шип, який подобається всім крім тебе?")
        enabled_list_truth.append("Який є персонаж, який не подобається нікому крім тебе?")
        enabled_list_truth.append("Який є шип, який не подобається всім крім тебе?")
        enabled_list_truth.append("Чи був персонаж, який тобі спочатку подобався, але тепер ти його ненавидиш?")
        enabled_list_truth.append("Чи був персонаж, якого ти спочатку ненавидів, але тепер він тобі подобається?")
        enabled_list_truth.append("Як ти придумуєш своїх персонажів? Що допомагає тобі з цим?")
        enabled_list_truth.append("На твою думку, який персонаж твого фандому є переоцінений, а який - недооцінений?")
        enabled_list_truth.append("яким був твій перший фандом? чи подобається він тобі зараз?")
        enabled_list_truth.append("які з персів вашого фандома є самі адекватні і розумні?")
        enabled_list_truth.append('який з персонажів твого фандома є самим найбільшим фанатом романтики')
        enabled_list_truth.append('чи є вашомо фандомі персонажі-вегетерянці/персонажі-вегани?')
        enabled_list_truth.append('роскажіть про іншого персонажа створеного вами, який вплинув на вигляд/характер вашого персонажа')
        enabled_list_truth.append('Який був твій перший персонаж')
        enabled_list_truth.append("Назви на яких персонажів з твоєї вселенної найбільше схожі кожен з гравців")
        enabled_list_truth.append("Хто би виграв у битві: ти чи твій персонаж?")
        enabled_list_truth.append("Які пісні з твого плейлиста, як ти думаєш, підходять твоїм персонажам")
        enabled_list_truth.append("Який є шип з твоїми персонажами, який подобається всім крім тебе?")
        enabled_list_truth.append("Який є твій персонаж, який не подобається нікому крім тебе?")
        enabled_list_truth.append("Який є шип твоїх персонажів, який не подобається всім крім тебе?")
        enabled_list_truth.append("Чи був в тебе твій персонаж, який тобі спочатку подобався, але тепер ти його ненавидиш?")
        enabled_list_truth.append("Чи був в тебе твій персонаж, якого ти спочатку ненавидів, але тепер він тобі подобається?")
        enabled_list_truth.append("Як ти придумуєш своїх ОС? Що допомагає тобі з цим?")
        enabled_list_truth.append("На твою думку, який персонаж твоєї вселенної є переоцінений, а який - недооцінений?")


        

    def creative_truth_disable():
        global enabled_list_truth
        enabled_list_truth.remove('яка гра/філм/мультфілм/серіал/мультсеріал/книга/комікс/аніме/манга серйозно змінила вашу творчість?')
        enabled_list_truth.remove("яким був твій перший персонаж? чи подобається він тобі зараз?")
        enabled_list_truth.remove("які з ваших персів самі адекватні і розумні?")
        enabled_list_truth.remove('який з ваших персонажів є самим найбільшим фанатом романтики')
        enabled_list_truth.remove('чи в вас є персонажі-вегетерянці/персонажі-вегани?')
        enabled_list_truth.remove('роскажіть про персонажа не створеного вами, який вплинув на вигляд/характер вашого персонажа')
        enabled_list_truth.remove('Який був твій перший фандом?')
        enabled_list_truth.remove("Назви на яких персонажів з твоїх фандомів найбільше схожі кожен з гравців")
        enabled_list_truth.remove("Хто би виграв у битві: ти чи твій любимий персонаж?")
        enabled_list_truth.remove('Чи в тебе є/були ОС по якомусь фандому? Якщо так, то опиши їх')
        enabled_list_truth.remove("Які пісні з твого плейлиста, як ти думаєш, підходять персонажам твого фандому")
        enabled_list_truth.remove("Який є шип, який подобається всім крім тебе?")
        enabled_list_truth.remove("Який є персонаж, який не подобається нікому крім тебе?")
        enabled_list_truth.remove("Який є шип, який не подобається всім крім тебе?")
        enabled_list_truth.remove("Чи був персонаж, який тобі спочатку подобався, але тепер ти його ненавидиш?")
        enabled_list_truth.remove("Чи був персонаж, якого ти спочатку ненавидів, але тепер він тобі подобається?")
        enabled_list_truth.remove("Як ти придумуєш своїх персонажів? Що допомагає тобі з цим?")
        enabled_list_truth.remove("На твою думку, який персонаж твого фандому є переоцінений, а який - недооцінений?")
        enabled_list_truth.remove("яким був твій перший фандом? чи подобається він тобі зараз?")
        enabled_list_truth.remove("які з персів вашого фандома є самі адекватні і розумні?")
        enabled_list_truth.remove('який з персонажів твого фандома є самим найбільшим фанатом романтики')
        enabled_list_truth.remove('чи є вашомо фандомі персонажі-вегетерянці/персонажі-вегани?')
        enabled_list_truth.remove('роскажіть про іншого персонажа створеного вами, який вплинув на вигляд/характер вашого персонажа')
        enabled_list_truth.remove('Який був твій перший персонаж')
        enabled_list_truth.remove("Назви на яких персонажів з твоєї вселенної найбільше схожі кожен з гравців")
        enabled_list_truth.remove("Хто би виграв у битві: ти чи твій персонаж?")
        enabled_list_truth.remove("Які пісні з твого плейлиста, як ти думаєш, підходять твоїм персонажам")
        enabled_list_truth.remove("Який є шип з твоїми персонажами, який подобається всім крім тебе?")
        enabled_list_truth.remove("Який є твій персонаж, який не подобається нікому крім тебе?")
        enabled_list_truth.remove("Який є шип твоїх персонажів, який не подобається всім крім тебе?")
        enabled_list_truth.remove("Чи був в тебе твій персонаж, який тобі спочатку подобався, але тепер ти його ненавидиш?")
        enabled_list_truth.remove("Чи був в тебе твій персонаж, якого ти спочатку ненавидів, але тепер він тобі подобається?")
        enabled_list_truth.remove("Як ти придумуєш своїх ОС? Що допомагає тобі з цим?")
        enabled_list_truth.remove("На твою думку, який персонаж твоєї вселенної є переоцінений, а який - недооцінений?")
        


            
    def hugs_n_cuddles_dare_enable():
        global enabled_list_dare
        enabled_list_dare.append("обняти будь кого")
        enabled_list_dare.append("групові обнімашки")
        enabled_list_dare.append("обняти будь кого з хлопців")
        enabled_list_dare.append("обняти будь кого з дівчат")
        enabled_list_dare.append("наступний гравець по черзі вирішує кого ти обнімеш")
        enabled_list_dare.append("гравець перед тобою по черзі вирішує кого ти обнімеш")
        enabled_list_dare.append("всі хлопці роблять групові обнімашки")
        enabled_list_dare.append("всі дічвата роблять групові обнімашки")


    def hugs_n_cuddles_dare_disable():
        global enabled_list_dare
        enabled_list_dare.remove("обняти будь кого")
        enabled_list_dare.remove("групові обнімашки")
        enabled_list_dare.remove("обняти будь кого з хлопців")
        enabled_list_dare.remove("обняти будь кого з дівчат")
        enabled_list_dare.remove("наступний гравець по черзі вирішує кого ти обнімеш")
        enabled_list_dare.remove("гравець перед тобою по черзі вирішує кого ти обнімеш")
        enabled_list_dare.remove("всі хлопці роблять групові обнімашки")
        enabled_list_dare.remove("всі дічвата роблять групові обнімашки")


    def general_dare_enable():
        global enabled_list_dare
        enabled_list_dare.append("покачайтеся на підлозі")
        enabled_list_dare.append('підійди до рандомної людини біля тебе і скажи: "а ви не знаєте де тут пятірочка?"')
        enabled_list_dare.append("кажи 'yeet' після кожного речення наступні 3 раунда")
        enabled_list_dare.append("говори ніби тобі 80 років поки не настане твоя черга")
        enabled_list_dare.append('тихо прокричи "амогус сус"')
        enabled_list_dare.append("поводьтеся як коза, яка вмирає")
        enabled_list_dare.append("заспівай будь-яку аісню з твого плейлиста")
        enabled_list_dare.append("запиши на відео наступний раунд")
        enabled_list_dare.append("говори з іншим акцентом до твоєї наступної черги")
        enabled_list_dare.append("говори протилежність того що ти хотів сказати до наступною черги")
        enabled_list_dare.append("заспівай 'im a barbie girl'")
        enabled_list_dare.append("дай кожній людині кличку, і називай їх так до твого наступного ходу")
        enabled_list_dare.append("покажи комусь з групи щось одне з цих: останне написане тобою повідомлення, останній пошуковий запит чи останне фото в галереї")
        enabled_list_dare.append("назви один плюс і один мінус кожного гравця")
        enabled_list_dare.append("намалюй якогось гравця з закритими очима, а інші мають вгадати")
        enabled_list_dare.append("заспівати 'never gonna give you up'")
        enabled_list_dare.append("Закрий очі і відкрий рот і дозволь іншому гравцю поставити будь-яку їжу в твій рот")
        enabled_list_dare.append("Ляж на підлогу і лежи там до наступного раунду")
        enabled_list_dare.append("Стань на коліна і попроси іншого гравця одружитися з тобою")
        enabled_list_dare.append("Станцюй дивний танець")
        enabled_list_dare.append("Покрутися навколо себе 10 разів і попробуй пройти рівно")
        enabled_list_dare.append("втечи без причини і вернись коли буде твоя черга або, якщо захочеш, раніше")
        



    def general_truth_enable():
        global enabled_list_truth
        enabled_list_truth.append("яку гру/мультфіль/фільм/серіал/мултсеріал ви би стерли з цього світу")
        enabled_list_truth.append('в тебе колись був видуманий друг?')
        enabled_list_truth.append("оціни милість будь кого крім тебе")
        enabled_list_truth.append("оціни милість себе")
        enabled_list_truth.append("роскажи про дивний сон який тобі приснився")
        enabled_list_truth.append("роскажи про смішну історію з свого життя")
        enabled_list_truth.append("як думаєш, якби наступив апокаліпсис хто би вмер першим")
        enabled_list_truth.append("коли був останній раз коли ти плакав")
        enabled_list_truth.append("назви безкорисне вміння, яке би ти вивчив")
        enabled_list_truth.append("якщо забрати всі складності переїзду, куди би ти переїхав?")
        enabled_list_truth.append("якби ти би гарантовано не получив ніяких наказань, кого би ти вбив?")
        enabled_list_truth.append("назви три програми в яких ти проводиш найбільше часу")
        enabled_list_truth.append("який твій найлюбиміший фрукт?")
        enabled_list_truth.append("якби ти міг сказати всім людям з будь якого часу якусь інформацію, і вони би її повністю зрозуміли і точно погодилися, що за інформація це би була")
        enabled_list_truth.append("скажи стидний факт про себе")
        enabled_list_truth.append("Якби ти міг прожити наступне життя як будь-яка тварина, яку би ти вибрав?")
        enabled_list_truth.append("Назви когось, кого ти притворявся, що вони тобі подобаються, але насправді ти не можеш їх терпіти")
        enabled_list_truth.append("Кому ти найбільше заздриш і чому?")
        enabled_list_truth.append("Ти колись брехав комусь про свій вік або ім'я?")
        enabled_list_truth.append("Якби ти був іншою статтю на один день, що би ти зробив спочатку?")
        enabled_list_truth.append("Якби ти був невидимим на один день, що би ти зробив спочатку?")
        enabled_list_truth.append("Які слова ти найбільше ненавидиш?")
        enabled_list_truth.append("Якби ти міг поміняти одну річ про себе, яка річ би це була?")
        enabled_list_truth.append("Ти віриш в інопланетян?")
        enabled_list_truth.append("Ти віриш в астрологію?")
        enabled_list_truth.append("Якби в тебе була хвилина, щоби взяти речі і втекти, що би ти взяв?")
        enabled_list_truth.append("Про що ти думаєш щоби заснути?")
        enabled_list_truth.append("Як би ти назвав свою країну?")
        enabled_list_truth.append('В тебе колись була фаза "я ненавижу рожевий"?')
        enabled_list_truth.append('коли був останній раз коли ти сильно злився')
        

        




    def generate_dare():
        """генерація chosen one для дії"""
        global chosen_one
        global enabled_list_dare
        chosen_one = random.choice(enabled_list_dare)
        print("\n" + chosen_one)


    def generate_truth():
        """генерація chosen one для правди"""
        global chosen_one
        global enabled_list_dare
        chosen_one = random.choice(enabled_list_truth)
        print("\n" + chosen_one)